<?php
$cnt = [
  [
    'title' => 'Как часто питаться?',
    'tags' => [
      'p' => 'Промежутки между всеми приремами пищи должны ровняться примерно 2,5–3 часам, если вы питаетесь 5 раз в день. Если вы хотите сократить приёмы пищи до 3 раз — то следует объединить первый перекус с завтраком и второй перекус с ужином, увеличив при этом промежутки между приёмами пищи до 5 часов. Последний приём пищи должен быть за 3 часа до сна.'
    ]
  ],
  [
    'title' => 'Нужно ли принимать витамины?',
    'tags' => [
      'p' => 'Во время завтрака принимаем витамины группы В, дополнительные добавки Омега-3 (с содержанием EPA\DHA 1000 мг). А для контроля над аппетитом и желанием есть сладкое принимайте препарат 5 –HTP (триптофан). Этот пункт несёт рекомендательный характер, а не обязательный.'
    ]
  ],
  [
    'title' => 'Основное распределение продуктов в течение дня',
    'tags' => [
      'ul' => [
        'Сложные углеводы (каши, любые крупы из перечня, макароны твёрдых сортов, хлебобулочные изделия (хлебцы), бобовые, вы употребляете на завтрак и обед',
        'Белковую пищу (мясо/рыба/морепродукты) употребляем во время обеда и ужина',
        'Натуральные сиропы и пекмезы, мёд, фруктозу, сухофрукты, орехи употребляем до 12 часов',
        'Фрукты с высоким гликемическим индексом употребляете за завтраком',
        'Фрукты с низким гликемическим индексом и ягоды можно есть до 14–15 часов',
        'Овощей должно быть в рационе очень много — они подойдут для любого приёма пищи и их можно не учитывать в размере порции'
      ]
    ]
  ],
  [
    'title' => 'Использование масел',
    'tags' => [
      'p' => 'Маслами заправляем обеденные салаты или овощи (после приготовления, непосредственно перед употреблением). Используем масла только холодного отжима. На масле жарить нельзя во время похудения.'
    ]
  ],
  [
    'title' => 'Супы лучше исключить',
    'tags' => [
      'p' => 'Супы старайтесь минимизировать, так как они не являются сбалансированным и полноценным приёмом пищи. На момент похудения исключаем.'
    ]
  ],
  [
    'title' => 'Сколько воды пить',
    'tags' => [
      'p' => 'Перед любым приёмом пищи за 10–15 мин. пьём 1 стакан негазированной воды. За сутки выпиваем 30 мл. на кг веса. Еду можно запивать водой.'
    ]
  ],
  [
    'title' => 'Чай и кофе',
    'tags' => [
      'p' => 'Чай и кофе пьём без сахара и других добавок, через 15–20 мин после основного приёма пищи.'
    ]
  ],
  [
    'title' => 'Соль и специи',
    'tags' => [
      'p' => 'Солить еду можно, но только перед употреблением — 3-5 гр. в сутки. Так же допускаются натуральные специи из списка рекомендованных продуктов во время приготовления блюд. '
    ]
  ],
  [
    'title' => 'Способ приготовления продуктов',
    'tags' => [
      'p' => 'Можете менять способ приготовления продуктов — например, если в меню написано отварная курица, то вы можете её тушить или запекать без масла, жарить на гриле без масла. Совсем не обязательно её только варить. И так со всеми продуктами. '
    ]
  ],
  [
    'title' => 'Продукты можно заменять',
    'tags' => [
      'p' => 'Можно заменять продукты на аналог: курицу на индейку, гречку на перловку, авокадо на орехи и тд.'
    ]
  ],
  [
    'title' => 'Меню гибкое',
    'tags' => [
      'p' => 'Используйте список продуктов — все продукты из него разрешены. Можно брать приёмы пищи из других дней — главное, чтобы они оставались по порядку. Обед на ужин из другого дня нельзя. '
    ]
  ],
  [
    'title' => 'Взвешивать порции обязательно',
    'tags' => [
      'p' => 'Обязательно приобретите себе недорогие кухонные весы, чтобы взвешивать порции блюд. На глаз вам будет трудно определить, сколько вы едите.'
    ]
  ],
  [
    'title' => 'Как взвешивать продукты',
    'tags' => [
      'p' => 'Крупы нужно взвешивать в сухом виде, то есть перед варкой. Все крупы указаны в сухом виде. Мясо и рыбу стоит взвешивать в готовом виде, то есть после приготовления, таким же образом они все указаны по граммам в меню.'
    ]
  ],
  [
    'title' => 'Можно ли питаться не по меню',
    'tags' => [
      'p' => 'Если вы планируете питаться не по меню вам необходимо все взвешивать и считать калории продуктов. Сделать это можно в приложение FatSecret или каком-нибудь другом счётчике калорий.'
    ]
  ],
  [
    'title' => 'Правила питания ДО и ПОСЛЕ тренировки',
    'tags' => [
      'p' => 'Едим за 1–1,5 часа до тренировки, после — можно сразу. Если питание по меню, едим то, что на очереди. Если питаетесь не по меню, после тренировки рекомендуется съесть: белковый коктейль на молоке, протеиновый батончик или печенье, салат с тунцом, отварные яйца или нежирные мясо и рыбу.'
    ],
    'if' => [
      'key' => 'target',
      'value' => 'Набор веса',
      'tags' => [
        'p' => 'Едим за 1–1,5 часа до тренировки, после — можно сразу. Если питание по меню, едим то, что на очереди. Если питаетесь не по меню, после тренировки рекомендуется выпить гейнер — это специальная добавка к основной пище, необходимая людям, тренирующимся для набора массы. В составе содержится смесь из белков и, конечно же, сложных углеводов. Углеводы выступают в качестве основного источника энергии, а белки — это «материал для строительства мышц»',
        'recommend' => 'Рекомендации по гейнерам',
        'p2' => 'Serious mass<br>
          В одной порции 625 ккал. 1,5  мерную ложку смешать с 250-300 мл молока или воды.<br>
          Mutant Mass<br>
          В одной порции 530 ккал мерные ложки смешать с 250-300 мл молока или воды.<br>
          Ultimate Nutrition<br>
          В одной порции 385 ккал. 2 мерные ложки смешать с 250-300 мл молока или воды.<br>',
        'images' => [
          'alt' => 'Изображение гейнера',
          [
            'url' => '/img/gainer-1.jpg',
            'webp' => '/img/gainer-1.webp'
          ],
          [
            'url' => '/img/gainer-2.jpg',
            'webp' => '/img/gainer-2.webp'
          ],
          [
            'url' => '/img/gainer-3.jpg',
            'webp' => '/img/gainer-3.webp'
          ]
        ]
      ]
    ]
  ]
] ?>
<div class="nutrition-rules-popup popup">
  <div class="nutrition-rules-popup__cnt popup__cnt">
    <button type="button" class="nutrition-rules-popup__close popup__close"></button>
    <span class="nutrition-rules-popup__title popup__title">Правила питания</span> <?php
    foreach ( $cnt as $c ) {
      $tags = $c['tags'];

      if ( $c['if'] && $user_data[$c['if']['key']] === $c['if']['value']  ) {
        $tags = $c['if']['tags'];
      }

      popup_content( [
        'title' => $c['title'],
        'tags' => $tags
      ] );
    } ?>
  </div>
</div>